backend/app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    words = Word.all

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    word = Word.find_by(id: params[:id])